eduardofabbris/error_detection/psoc6_dut.cydsn/Generated_Source/PSoC6/DMA2.h
__STATIC_INLINE uint32_t DMA2_GetInterruptStatus(void);
__STATIC_INLINE void     DMA2_ClearInterrupt(void);
__STATIC_INLINE void     DMA2_SetInterrupt(void);
__STATIC_INLINE uint32_t DMA2_GetInterruptMask(void);
__STATIC_INLINE void     DMA2_SetInterruptMask(uint32_t interrupt);
__STATIC_INLINE uint32_t DMA2_GetInterruptStatusMasked(void);


/***************************************
*    Global Variables
***************************************/
extern uint8_t DMA2_initVar;

extern const cy_stc_dma_descriptor_config_t DMA2_Descriptor_1_config;
extern cy_stc_dma_descriptor_t DMA2_Descriptor_1;



/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: DMA2_Stop
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA2_Stop(void)
{
    Cy_DMA_Channel_Disable(DMA2_HW, DMA2_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA2_ChannelEnable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Enable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA2_ChannelEnable(void)
{
    Cy_DMA_Channel_Enable(DMA2_HW, DMA2_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA2_ChannelDisable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA2_ChannelDisable(void)
{
    Cy_DMA_Channel_Disable(DMA2_HW, DMA2_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA2_SetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA2_SetDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Channel_SetDescriptor(DMA2_HW, DMA2_DW_CHANNEL, descriptor);
}


/*******************************************************************************
* Function Name: DMA2_GetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetCurrentDescriptor() PDL driver function.
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * DMA2_GetDescriptor(void)
{
    return(Cy_DMA_Channel_GetCurrentDescriptor(DMA2_HW, DMA2_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA2_SetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA2_SetNextDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Descriptor_SetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(DMA2_HW, DMA2_DW_CHANNEL), descriptor);
}


/*******************************************************************************
* Function Name: DMA2_GetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * DMA2_GetNextDescriptor(void)
{
    return(Cy_DMA_Descriptor_GetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(DMA2_HW, DMA2_DW_CHANNEL)));
}


/*******************************************************************************
* Function Name: DMA2_SetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetPriority() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA2_SetPriority(uint32_t priority)
{
    Cy_DMA_Channel_SetPriority(DMA2_HW, DMA2_DW_CHANNEL, priority);
}


/*******************************************************************************
* Function Name: DMA2_GetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetPriority() PDL driver function.  
*******************************************************************************/
__STATIC_INLINE uint32_t DMA2_GetPriority(void)
{
    return (Cy_DMA_Channel_GetPriority(DMA2_HW, DMA2_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA2_SetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA2_SetSrcAddress(cy_stc_dma_descriptor_t * descriptor, void const * srcAddress)
{
    Cy_DMA_Descriptor_SetSrcAddress(descriptor, srcAddress);
}


/*******************************************************************************
* Function Name: DMA2_GetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void * DMA2_GetSrcAddress(cy_stc_dma_descriptor_t const * descriptor)
{
    return(Cy_DMA_Descriptor_GetSrcAddress(descriptor));
}


